{
  "aquarius": {
      "0": "The shifting vibe will have a reviving effect for most earth signs. Specifically, you'll almost definitely have a refined sense of excellent timing, especially when it comes to a potentially bold statement. In addition; incoming information may bring a minor uplift before the day is through!",
      "1": "It's a nice kind of day where you can demonstrate your warmer side with some possibly unexpected results on the romance front. That said; you may well glean some fresh insight with regard to a platonic relationship too. The latter part of the day will be particularly primed for some useful dialogue!",
      "2": "The day is likely to be broadly constructive, if you can negotiate a pricklier morning. Making necessary changes to a specific practical/ material matter may feel harder than it needs to be. It may be a question of waiting for a possibly unexpected development to be concluded, one way or another!",
      "3": "A slight dent in your confidence levels could have you doubting yourself, but keep an open mind on the work front, and don't be too quick to abandon any ideas or plans that you think are unrealistic. The rigorous planetary mixes are actually giving you a cautious green-light!",
      "4": "Thanks to certain lunar energies you're likely to experience a lack of confidence in trying anything new. However, this could give way to a distinct feeling as though you've hit a brick wall. If you are to overcome this then you may need to take a couple of minor risks or at least venture out of your comfort zone!",
      "5": "The day may feel a little off-beam when it comes to timing. There's a possibility of a useful disclosure. That said; you may find that you're a little wary when it comes to taking firm action. It may be best to make those decisions that can be easily reversed if necessary!",
      "6": "A fiery vibe is likely to bring out your competitive spirit, and while you may feel pressured to impress certain types, try to avoid taking any risks, at least until this vibe passes. Specifically; if you know that normally you would develop second thoughts, then think before you dive in!",
      "7": "Communications may present some minor problems today, especially with close friends or partners. You may start to feel that you're living in a comedy of errors, but a great sense of humor will enable you to see the funny side! It's not all muddled and misleading though: one illuminating comment proves useful!",
      "8": "It's a good day. The only downside is that you might not be able to everything on your to-do list. However, since there's an emphasis on creative thinking and imaginative solutions, do make sure you keep a record of what goes through your head. An off-the-wall scheme or plan might just work!",
      "9": "Your cash flow situation looks less than promising. However, it's best if you regard a forgotten bill or invoice as a useful wake-up call to get your finances in order, because your naturally business-minded nature will be as sharp as ever. Efficiency and speed are your pals today!",
      "10": "Thanks to an abrupt shift in the vibe, which could bring a slightly doubtful, hesitant flavor for most Goats, it's a day to be a little more decisive and to trust your own judgment. Don't worry too much about what others may be thinking, particularly when it comes to obsolete matters!",
      "11": "Take it easy, because there are quite a lot of unsettling lunar influences, making things a little unpredictable for most signs. In your case it's likely to be a personal relationship that will need a 'tailor-made' approach; that is to say, your responses should really depend on the immediate circumstances!",
      "12": "It's a day where you may well feel slightly down without being able to really figure out what is dampening your usual optimism. However, as the day progresses, you may find yourself reflecting deeply on a couple of unresolved issues. There may even be a sudden and quite obvious realization!",
      "13": "Breezier influences are likely to add a little sparkle to the week and while this will be constructive to an extent, take care with recent and/or resolved issues. There may well be a slight inclination to repeat an old mistake. This is likely to be minor, but time-wasting, nonetheless!",
      "14": "A fiery sun/moon mix could bring a more positive slant to an unresolved matter. That said; you may need to overcome slight qualms when it comes to re-addressing this. It'll be possible to repair a slight rift, but you may just have to try and ignore the opinions of a fairly inflexible participant!",
      "15": "Irritable influences will start to disappear, leaving you feeling energized and well-organized for the day. You may even find that a previously challenging glitch or obstacle actually requires minimum effort. Don't waste time questioning this shift in luck; clear your workload in preparation for a sociable weekend!",
      "16": "Think of today's planetary influences as something of a mirage: fabulous influences in the morning might imbue you with plenty of the feel-good factor and might suggest a great romantic development, but the afternoon is likely to bring mixed signals and mixed messages!",
      "17": "It may be one of those days where you may need to adjust your approaches according to the circumstances. Where practical issues may require a discreet approach, emotional matters may require more openness. Be aware that you could send out mixed signals on the romance front without realizing it!",
      "18": "The recently driven vibe will begin to ease. That said; don't let work-related opportunities drift by, because they may not crop up again anytime soon, and should be taken seriously. You, along with several other signs, may need to resist an inclination to take the easiest route for today!",
      "19": "There is a tendency to take on too much and delegate far too little. This is likely to be down to a desire to maintain full control in what could feel like an unruly atmosphere. However; your methods may be a little clumsy. You may well need to refrain from micro-managing other people!"
  },
  "aries": {
      "0": "Speaking your mind comes naturally to you today as Mercury moves into a fellow Fire sign. Drawing connections between various viewpoints helps you put things into a new perspective, without losing sight of the past. Your thoughts are firing quickly today, so ground into your emotions to contain the excess energy. Channeling your mood in this way brings strength to your voice and assertiveness to your interactions. Setting emotional boundaries will bring the clarity that you need.",
      "1": "Turn your fantasies into art. Pursuing a fusion of grace and grit might lead you to become involved in some form of creative endeavor. However, your key requirement now is that you are active, and that your action inspires people to imagine wonderful things and even to pursue their own passion projects. You relish shaping a rough object into a lovely form with the force of your heart and hands. This tangible process is intimate and immediate. Author Elaine Scarry wrote, \"Beauty quickens. It adrenalizes. It makes the heart beat faster. It makes life more vivid, animated, living worth living.\"",
      "2": "You’re headstrong and have your battle armor on today and you don’t care who knows it. Your quick-fire decisions could earn you a place in the spotlight, but if you’re not careful, rash behavior could have a negative effect on your reputation. On the plus side, you have ample energy and verve to make great accomplishments. Your natural leadership abilities are on full display. Lack of material resources cannot hold you back now -- you’ll find inventive solutions to practical problems. You know better than anyone that where there’s a will, there’s a way.",
      "3": "Big plans you have for yourself may seem momentarily muddled today. It's hard to develop a strategy for growth when nothing looks clear; digging into the work at hand may be the smarter option now. Don't abandon your pursuits altogether but consider moving them to the back burner while you focus on real, actionable steps in your present life. Once the fog dissipates, you will be ready to hit the ground running toward your greater aspirations. A brief pause now can actually be productive in the long run.",
      "4": "You could become impatient with an authority figure who is afraid to take a risk. Exploring unknown territory is second nature to a pioneer like you. When people try holding you back, you become anxious and resentful. Try channeling your frustrations in a positive direction today by creating something new on your own time, whether it’s tangible or more abstract. Not only will this allow you to blow off steam, exercising your imagination will also help you attract more wealth. Don’t be surprised if you’re soon offered a lucrative opportunity.",
      "5": "Finding ways to expand your personal resources is possible if you tap into your natural leadership ability today. Rather than copying what other people have done, you might break new ground. As a result, you could develop something that is profitable for you. Keep this concept a secret in its early phases; the last thing you want is to get discouraged by a well-meaning critic. By devoting some time each day to this concept, you can iron out all the kinks until you have an airtight presentation. Don't be surprised if you get a great reception.",
      "6": "You might want to put off choices or conversations about family and home matters as Mercury turns retrograde... While this may be difficult for an action-oriented person like you, this is a better time to gather information. Shift your focus and learn as much as you can about your options in another area of life. Taking a careful look at the details of your housing, school, or job possibilities will help inform your next steps. You may even know someone with connections in one of these areas who could help you out.",
      "7": "Never one to be confined, you're especially eager to break free from feelings of restriction now. In fact, you may adopt a whole new persona or lifestyle while Mars, your ruling planet, is in your sign, forming a beneficial angle to the adventurous Moon. Be your bold self today and make a change to your look, name, or role. Don’t worry about what others think of this transformation. Your guiding light should be your heart’s desire, not their opinions. When an idea fills you with delight, it's a sign you should act on it.",
      "8": "A dynamo like you needs a relaxing haven from the world. If buying your own place is a goal that's been out of reach, today you may find the means needed to purchase some beautiful property. A generous relative could give you the money for a down payment or you might inherit a family home. It's also possible you may sell one house and buy another today. Stop thinking about all the obstacles that lie between you and your domestic dreams and imagine what it will feel like when you attain them.",
      "9": "You and a close partner in business or romance may strategize today about how to reorganize assets, reallocate funds, or bring in a sudden windfall of cash. The more flexibility, innovation, and creativity you can bring to the table, the better, for clinging to the status quo and the well-tread paths of the past will not work today. Get rid of some possessions or values that are inhibiting your flow and allow your conversations and brainstorms to be characterized by freedom and movement.",
      "10": "You are powerful, and your strength comes from knowing that you have amazing people in your corner. Today is a great day to spend quality time with the people that make up your personal community and show them how much you appreciate them. Host a small, distanced backyard hangout with good food and conversation (don’t forget to invite your neighbors!), or grab a couple of friends and attend a local charity event to give to those in need. Everyone will love your enthusiasm!",
      "11": "You’re the picture of courage, but you could end up sticking your foot in your mouth if you’re not careful! Your rebellious nature can go overboard if you let your ego get control of your tongue, and you will want to avoid retaliating harshly if others offend you. Outbursts are likely, but you can also present yourself as a leader and a protector if you channel the energy correctly. Be a friend and a defender instead of a bully."
  },
  "cancer": {
      "0": "It is one of those days where doing nothing may well have a slightly negative effect, even if you're chilling and relaxing. Make sure that you don't waste your time, or you could end up feeling irritated with yourself. Pack several activities into your day to make it one to remember!",
      "1": "Personal relationships may well come under the spotlight, and you might need to rethink your approach to a close friend or your partner. A misunderstanding or miscommunication can be easily resolved, as long as you're open to the fact that maybe you were wrong. There'll be no place for any bluff and bluster!",
      "2": "Thanks to bubbly vibe there is a slight tendency to overstate the case and to over-estimate what you can do. In the light of this, not only could practical/material matters be subject to avoidable errors, but you could commit a minor gaffe when it comes to emotional matters too!",
      "3": "A practical/material matter or problem may benefit from a rethink, which should lead into a constructive change in tactics. It's certainly a day to heed the distinctly cooling vibe. That is, try to avoid implementing wildly creative solutions when the simplest one will do!",
      "4": "Solar shifts are likely to restore a more practical sense of balance between work and leisure. Relationships in general, however, might not be quite so predictable. An inclination to shrug off someone's concerns could give way to unnecessary tension before the week is through!",
      "5": "t is not a day to take the obvious for granted. Shifting influences will be positive in general, but for you there could be a moment of minor friction. Get any silly misunderstandings cleared up sooner, rather than later, no matter how time-pressured or busy you are!",
      "6": "It's the sort of day where you can probably get away with working on or tending to one specific thing, be it a personal project or a work-related matter. You'll have buckets of concentration and a pretty low tolerance for distractions and interruptions, so if possible, avoid team-work!",
      "7": "Recent complications should ease into a more a leisurely day. However, while the current influences may seem quite tame, there is a note of caution. It's not a great day to negotiate or strike up new agreements. A marginally timid undercurrent suggests that you'll possibly lose out!",
      "8": "A rather determined vibe will develop, making this a day to mop up, clear up and generally settling ongoing matters. While you'll have a certain amount of cosmic leverage, do bear in mind that it may be harder than usual to bend and tweak any tacit rules to your advantage!",
      "9": "There could be a slightly anxious feel about the day, which could have you feeling a little fretful for reasons that may not become entirely clear immediately. However; planetary transits may well cast an unnecessarily critical light on a particular matter. It may be best to leave things alone until after the weekend!",
      "10": "Tender aspects are likely to ignite romance, and yet a high-maintenance vibe could act much like a wet blanket. Certain things said may be taken out of context. Casually flirty exchanges may lead to minor misunderstandings. It's certainly a day to be a little more subtle!",
      "11": "A cosmic clash suggests that tension could bubble up: this is likely to be between what you want to do and what you should be doing. This could be as basic as work versus leisure, or something slightly more involved. Either way, don't resort to quick and easy solutions to complicated matters!",
      "12": "You may need to tone down a slightly domineering approach. The more you push, the more others are likely to resist. Harsh words are likely to get you nowhere fast. As an aside, do make sure that you're doing your fair share, in order to keep the momentum going!",
      "13": "It's a day where the overall vibe is likely to become more chaotic and unpredictable, perhaps a little too much. There's a slight tendency to be slightly narrow, especially when it comes to initiating looming matters. Specifically; there may be a slight unwillingness to engage with a slippery matter!",
      "14": "There's a dual emphasis for most twins on the past and on romance. The two may not be directly connected, although for some, the possibility of a commitment could emerge. In addition; a slight shift in your perception could result in a fresh choice. Don't rush to conclude something still lingering!",
      "15": "A Jupiter/Mercury aspect is likely to help you to get to the bottom of something that maybe has been troubling you on and off. While specific developments today may not be very noticeable, there is a definite easing of a recent or ongoing matter. A go-with-the-flow approach will certainly help!",
      "16": "Solar shifts are likely to restore a more practical sense of balance between work and leisure. Relationships in general, however, might not be quite so predictable. An inclination to shrug off someone's concerns could give way to unnecessary tension before the week is through!",
      "17": "Today may feel a little too lax on a couple of fronts and while you may feel tempted to impose order, you'd be unwise to give in to a desire to control everything. Certain plans and efforts may well develop unanticipated complications. It'll be best to adjust your methods as you go!",
      "18": "The positive lunar aspects lighten the mood considerably. That said; romance may present some challenges for you. It may not be the best day to try and address this: misguiding influences may have you blurting something out, which you might find difficult to retract again!",
      "19": "Minor clashes with slightly bossy types could have you feeling rather hemmed in. You will certainly need your space, and given that it's likely to be a fairly inflexible day, you should perhaps meet reasonable suggestions halfway. Negotiate this one sensibly and with a little consideration for co-workers and colleagues!"
  },
  "capricorn": {
      "0": "It's not the best day to take a stand, since the current planetary line-up may well bring about a subtle air of indifference. In addition, the Jupiter/moon mix could cloud your judgment, and may well have you spending too much time on non-starters, especially when it comes to new ventures on the business front!",
      "1": "Go easy on personal matters, since it's not a day to initiate dialogue over minor, everyday infractions. It's perhaps not a day to dwell on a missed opportunity or opening either. Bear in mind too that for most Archers, a fretful sun/moon mix is likely to temporarily amplify a case of needless regret!",
      "2": "There's certainly an element of feeling time-pressured for nearly all fire signs and given that it is likely to be a full day, you may need to be a little more selective about what you can achieve. Don't be too agreeable for the sake of it and don't let others offload onto you!",
      "3": "Fabulous influences may well lead to one or two lucky breaks and even if there are any minor obstacles to overcome, the planets are nicely configured to give you that extra little push. It's definitely a day where you should take the longer term view and believe that anything is possible!",
      "4": "Yesterday's tensions melt away as the emphasis shifts to your social zone. Friends will be calling on you from the start and you're likely to be in sparkling form until late into the evening. The key word for you right now is fun, although the planets suggest that an inclination to overindulge may need to be reined in!",
      "5": "While you're likely to sidestep the more chaotic influence of the dual vibe, you are likely to feel slightly constrained by other people's unpredictable attitudes. Specifically, an answer or response may well undergo a few stages and a few changes before it's accepted. It may be best to wait it out!",
      "6": "A slight inclination to over-indulge may well extend throughout the entire day, thanks to the moon. That said; minor misunderstandings and crossed wires will be entirely avoidable if you're more on the ball. As an aside, romantic developments may be uplifting, but short-lived!",
      "7": "The planets lighten up considerably today, bringing a much easier going day. Plans will go well and it will be a great day to take a friend or your partner to a place that revives old and pleasant memories since nostalgia features quite strongly. Revisit old and favorite places!",
      "8": "A need to straighten out any current work/school matters may well be down to the Pluto/moon aspect. Clearing any outstanding tasks/assignments is all well and good, but it's a day where you're very likely to discard something that you'll need further down the line. Proceed with caution!",
      "9": "A whole mix of influences may create a slightly conflicted vibe. You may feel almost obliged to motivate, inspire or support others when it comes to innovative ideas on the work front. However, it may be that your heart's not really in it. Perhaps it's a day to be ever so slightly more selfish!",
      "10": "There is a slightly misleading quality about the day's general vibe. It may be that nothing is as it seems. Communications may well complicate a personal matter. The best approach may well be to avoid rash or impulse decisions. Gains made today may be lost after tomorrow!",
      "11": "There's a very subtle conflict in the cosmic line-up. Muddled or vague communications could be the root cause of a misunderstanding. It may help to be clear about what you're supposed to do and be clear about what you expect others to do. One specific predicament may need to be completely reconsidered!",
      "12": "A positive string of influences indicates an excellent day in terms of your social life, whereas a challenging aspect from the moon suggests that relationships in general may need a little space. A sense of freedom will keep your mood buoyant; feeling constrained will cause a slump!",
      "13": "Today is likely to be one of those days where you are determined to do your own thing, thanks to a burst of fiery influences. That said; there is a tendency to get completely carried away with this. It's certainly not a day to draw too many lines or impose too many conditions!",
      "14": "When it comes to career and practical matters most Archers will be able to shrug off the effects of the unhelpful undercurrent. You may find, however, that romantic matters are not so easily smoothed. A piece of common-sense advice may well irritate you, but that may be because you'll recognize the element of truth in it!",
      "15": "You are likely to experience an emotionally challenging day, but in terms of work or home life you will be bubbling with confidence! You may find this strange mixture bewildering; just make sure that you use your spare time to relax and recharge your batteries.",
      "16": "The minor but taxing planetary aspect that disrupted your finances will shift by the late afternoon. So you may wake up feeling a little low and listless, but decide that you will accept any invitations out anyway, because by the time the evening comes you'll be primed and ready for a fun time!",
      "17": "It may start to feel, particularly by the late afternoon, as though everything is beginning to slip out of your control. What may have felt definite and certain in the morning may be subject to further scrutiny later on. Emotionally based promises made earlier may be a little flimsy in particular!",
      "18": "A couple of minor aspects will make this a sort of clearing-up day, perhaps even literally, if you have overdone it slightly. A minor stroke of good luck could materialize at the right time, while a slight boost to your finances or some good news should be taken as a positive sign!",
      "19": "Although the mood will feel relaxed, there may be a marginal edge to the general vibe. There is a slight tendency to be a little materialistic. If you can channel the fiery vibe, then it could give way to a minor opportunity. The key word is if, since short term distractions are likely!"
  },
  "gemini": {
      "0": "Communications are about to get a little intense. The overall vibe is likely to switch into a firmly informative one. Look for a sense of confirmation with regard to a fairly recent issue. Although there may be subtle signs that this won't be fully resolved, there is a hint of distinct progress!",
      "1": "Given the tense Pluto/moon mix, you may need to revise your approaches a little. It's possible that your expectations of others and what they can do will be a little too high. It's certainly a day that could benefit from some give-and-take. By the same token, be as fair as possible if someone asks for help from you!",
      "2": "Communications are more favorably aspected, thanks to lighter lunar aspects, which may well add a dash of fun to the proceedings too. Even if you're tempted to rely on luck rather than your usual careful planning, you should still manage to tap into the cooperative vibe!",
      "3": "It's a much better day, because instead of making you feel restless, sparkling influences are likely to point to remedies, solutions and good strategies. Situations should be easier and more accommodating than yesterday. If you do feel like branching out slightly, you won't end up feeling thwarted by practical restrictions!",
      "4": "The moon may well encourage you to look backwards at a point when there may be some useful developments on the career front. Communications won't be at their strongest either, which means that you could miss any subtle indicators that could guide you in a different direction!",
      "5": "Mixed aspects could make you quite flighty today, and you're likely to be in the mood for a little excitement and adventure. Warm cozy moments will appeal less, while crazy dates and zany fun with your friends will appeal more. Romance could be the cause of a slight let-down!",
      "6": "A slightly erratic vibe could create very slight discord in your work-based relationships. You may feel that someone is perhaps being a little too careless or possibly even offhand. That said; while it's not a great day to correct others, it may actually benefit you directly to bide your time for a day or two!",
      "7": "Unfortunately, the influence of Pluto will make itself felt in your life. It could be difficult to keep your temper and it may well seem as though certain individuals will be doing their best to annoy you. It would be very helpful to count to ten before reacting. Don't rise to the bait!",
      "8": "The watery moon suggests that you may veer off course over a material/practical matter. The answer is fairly simple, although it might not be immediately obvious. However, there may be a minor issue, most likely related to incoming information that will need to be at least acknowledged, even if you can't address it right now!",
      "9": "There may be a need for a certain amount of moderation, because you're likely to be a little more impulsive than usual. You'll be less likely to stop and think if you've got your heart set on something. If romance is involved, then it may be best to wait until later in the week!",
      "10": "Fairly intense lunar influences are is likely to divert your attention to an emotional issue, although your responses may be a trace on the dramatic side. True, it's not the best day for easy going dialogue, but it will be best to at least acknowledge the issue, even if you intend to postpone it for a while!",
      "11": "It is likely to be an impulse versus thoughtful kind of day. You may need to resist a slight tendency to invest all your time and energy in one specific area or activity that is perhaps not worth all your attention. If something seems to be too involved then put it on hold for a while!",
      "12": "The shifting moon may bring a rather erratic vibe. The pushy morning hours are likely to ease into a rather languid afternoon, but don't be fooled. Any lack of effort or attempt to opt for the easiest route will be noticed, and even if it's not verbally noted today, it will be at some point!",
      "13": "It may be a day where you'll be inclined to hesitate with regards to a looming decision, most likely related to unexpected news. This could revolve around a change in your day-to-day life. In order to make progress you may need to think outside the box. Unusual solutions aren't out of the question!",
      "14": "Mixed influences are likely to usher in a slightly assertive mood in a general atmosphere of marginal pressure. While you shouldn't ignore little glitches and errors completely, it'll be a good idea to keep them in perspective and not devote too much time to needless scrutiny!",
      "15": "Misinformation may be par for the course, thanks to subtle planetary shifts, which suggest a slight sense of misdirected effort. Those who are working today may unintentionally end up chasing rainbows. In addition; a platonic relationship could be put under temporary strain, possibly due to an attempt to impress!",
      "16": "Yesterday's pesky influences ease significantly: today is about relaxation and switching off. Indulge yourself a little: visit the mall, or try online shopping. You don't need to break the bank to purchase a little pick-me-up, decide what you can afford before you start, and stick to your limit!",
      "17": "It's a day where you have the capacity to be quite industrious, but you may feel a lot easier if you take relatively small steps. Attention to detail will be your main strength. However; if you need to report minor errors to colleagues, then be careful how you go, especially if the error is theirs!",
      "18": "Things should start feeling a little less heavy, so don't be surprised if you start to feel lighter-hearted and less goal-centered. If someone offers an unusual invitation, or you find yourself on an unusual date, go with it. That said; you'll be back to counting the cents again!",
      "19": "Unfortunately, the influence of Pluto will make itself felt in your life. It could be difficult to keep your temper and it may well seem as though certain individuals will be doing their best to annoy you. It would be very helpful to count to ten before reacting. Don't rise to the bait!"
  },
  "leo": {
      "0": "You might need to take a step back. The gentle, sensitive dreaminess often associated with your sign is not going to serve you too well. If a lingering or recent matter emerges out of the blue then deal with it first before trying to figure out how it happened. Don't be surprised if you receive a belated apology, either!",
      "1": "A corrective vibe will have it uses, but there may be a minor cosmic penalty to factor in. Mixed messages and possible cancellations of some kind are likely. If you're on the receiving end of a minor letdown, then make sure you know why. There could be a very valid explanation!",
      "2": "The current cosmic mood is likely to bode well for work-related matters. However, you're likely to set rather high standards and others may not be able to match them. It's also possible that you'll be slightly flustered about a separate matter, which may well spill over into non-related areas!",
      "3": "It is possible that people at work or school will be looking to you for some guidance or help today, especially in terms of resolving tensions. This is due to your higher levels of empathy and understanding, which means that the comfort you provide will be naturally inspiring!",
      "4": "Although change is in the air, it may not be the right time to initiate anything that requires longer-term commitment, since the moon may well draw your attention to something missed. This could revolve around a lingering obligation on the personal front. It's perhaps a day to pace yourself!",
      "5": "If a slightly carefree and careless vibe led to minor mistakes yesterday, then today you may sense a slightly pressured and humorless vibe urging you to correct them. It'll be best to respond to valid criticisms gracefully. It's certainly not a day to try and sidestep your responsibilities!",
      "6": "In the clash between the restrictive influences and the more expansive ones you may find yourself aligning to the restrictive ones every time. You might benefit from, not breaking them as such, but certainly tweaking them. Don't stray too far from your comfort zone, though!",
      "7": "As unexciting as it sounds, you might find the need to overhaul your finances. However, thanks to a couple of analytical influences you are likely to spot and then rectify any potential problems or errors. You may even find some new ways to increase your wealth!",
      "8": "It's a day to do what you can, given the rather haphazard, unreliable vibe. Just bear in mind that relying on others may not be your best strategy. Incoming advice should be analyzed very carefully before you act on it. If it all gets a little too much, then remember that balance should be restored tomorrow!",
      "9": "The fiery full moon is likely to bring out your perceptive side. There's a very sharp vibe that will contain just enough of an adventurous spirit to be highly constructive. All that said; your people skills may take a slight dip, so do watch how you interact with others!",
      "10": "The overriding vibe for today is likely to be a very mixed one; mixed enough to make it quite difficult to second-guess any obvious outcomes or results. Something you hear may well point towards a glitch or blip in a recent matter or transaction. What you need to do is stick to the facts!",
      "11": "Today's vibe has the capacity to be both awkward and helpful. Thanks to shifting planetary accents, a slight shift in your perspective could make one specific issue easier. It could be that a discovery may well help to resolve a recent and negative development. Don't leave it to stew!",
      "12": "Romance slips down a gear, but it will still be ticking over in the background, so don't let it dominate all your time. Instead, use the day to attend a practical matter or task. Perhaps there's something that you've postponed for a little too long; if so, address it now, or your lack of concern could provoke someone's impatience!",
      "13": "A slight sense of pressure and/or time-limits may settle in as the hours progress. Minor risks with material matters might look safe enough, but if it's an either/or choice, then it might be wise to lean towards the more cautious option. There may be a secondary issue that revolves around who gets the final say!",
      "14": "While the current planetary line-up may well guide you into some moments of insightful analysis, the timing might not be right for acting on any fresh realizations, just yet. That said; the planets may well pave the way to clear the air in a day or two, although a cosmic hint may well turn out to be a useful one!",
      "15": "A subtle and rather draining vibe could shape the day to an extent. Your energy levels are likely to dip just as other people's demands begin to stack up. In addition; you may need to stop a particular discussion or exchange in its track, particularly if it starts to turn a little edgy!",
      "16": "It's a day where you are likely to be a little too subtle and perhaps a little too evasive. Direct and blunt responses may simply be beyond you, for today. Avoid getting into any deep heart-to-hearts, especially where the subject is focused around practical or material matters!",
      "17": "There could be a very minor clash with regards to a career matter and while the morning vibe is likely to be dynamic, you may have to wait until the late afternoon for full insight and/or clarity. An ongoing issue may bubble up again at the wrong time too. A wait-and-see approach may be the best approach to take!",
      "18": "A more dynamic vibe may well encourage a more one-sided approach to a specific, possibly tricky issue. Do take care with numbers and figures, because while you may be convinced that you know what you're doing, it's definitely a day where little mistakes will occur!",
      "19": "There may be an either/or choice to make in order to make the most of the day's renewed vibe. A minor setback on a personal level is likely to be less significant than it appears, and you may need to let other matters slip down the agenda for the time being in order to dedicate more time to a romantic matter!"
  },
  "libra": {
      "0": "An understated planetary disruption could bring a slight amount of tension into your general relationships. Don't get drawn into disputes about potential situations that haven't yet developed. In addition; an offer that amounts to an olive-branch should not be declined without thought!",
      "1": "The focus is on romance and relationships from start to finish. Singles will be attracting more than their fair share of attention, but whatever your status, don't ignore a minor and recent misunderstanding. Don't let unsubstantiated 'ifs' and 'maybes' stop you from getting back on track, either!",
      "2": "The one area that could really benefit from today's influences is relationships; particularly friendships. A moment of recent instability can be repaired, if you're prepared to invest some time. There's plenty of scope for gently and subtly nurturing your professional relationships, but the key word is subtly!",
      "3": "A slightly iffy start to the day may throw a spanner in the works early on. In order to deal with it, you may need to filter out the emotional angle and concentrate on the objective facts. You may, as a result, realize that you have more say and control than you originally presumed!",
      "4": "A troublesome aspect from the moon will move away by the end of the day, and you'll be more inclined to be sensible as you return back down to earth. That said; you should treat practical/financial matters with a degree of caution. If it's a head versus heart decision, then let your head rule!",
      "5": "A confusing undercurrent of a Mars/Venus mix may well muddle matters and cloud issues. It could be that you'll look for the answer in the wrong place, or that practical considerations will get in the way of a potential romantic development. Objectivity will be what is missing!",
      "6": "Today should prove to be a vast improvement on yesterday, with any differences between you and a friend being ironed out completely! On a slightly less positive note romance is likely to seem like hard work today; misunderstandings and mis-communications could cause unnecessary tensions!",
      "7": "A strong planetary formation will be somewhat swamped by the strong lunar vibe. As a result, success in romance may be a little hit-and-miss. Try not to be too inflexible when it comes to small but unexpected changes and differing opinions. Sometimes it's best to take a step back!",
      "8": "A sprightly vibe in the morning is likely to give way to a more cautious one in the evening. In terms of romance you may need the skill of some good timing to make the most of this. It's possible that a distraction part way through the day will need to be dealt with decisively!",
      "9": "A Mercury/Jupiter mix suggests that there may be something you need to let go. If you're simmering over a recent argument or misunderstanding now is the time to put it behind you and move on. One specific issue that may have been bubbling beneath the surface should ease off in a couple of days' time!",
      "10": "Thanks to the full moon, there may be a need to not just open up the communication lines, but to maintain them too. While someone may appear to be a little detached or even outright aloof, there is also an inclination to block someone else's good ideas. It's not a day to increase the tension!",
      "11": "Today's planetary changes bring a lighter hearted tone, and should reintroduce a slight shift in your perspective. You may find that an inclination to buck the trend will have an interesting side-effect: people will listen, and there could be a very interesting response to ponder too!",
      "12": "It will be a good day for a jaunt to the mall but it won't be so great for cash matters. Don't put temptation in your way; stay away from the stores and hold onto your reserves for tomorrow's planetary aspects will have you itching to spend at a point when money matters look a lot healthier!",
      "13": "The focus is on romance and relationships from start to finish. Singles will be attracting more than their fair share of attention, but whatever your status, don't ignore a minor and recent misunderstanding. Don't let unsubstantiated 'ifs' and 'maybes' stop you from getting back on track, either!",
      "14": "Planetary influences are being a little disruptive. A piece of misinformation from someone who's normally ultra-reliable may need to be double-checked. Following instructions indiscriminately could set you on the wrong path. Don't turn your back on something that needs your attention!",
      "15": "A challenging Mars/moon mix may well exaggerate an inner sense of doubt. Feeling out-of-step with the general trend may not help much either. However; underpinning all that is a possible dawning realization that you perhaps need to be a little more proactive on one particular front!",
      "16": "A sensitive undercurrent is likely to offer enough guidance to give the right responses and answers, particularly when it comes to a possibly tricky issue. That said; it may be harder than it sounds to generate a positive attitude, especially when it comes to something that is perhaps just beginning to needle you!",
      "17": "It's a day where mistakes are likely, thanks to a slightly carefree vibe. Double-check any recent transactions. In addition; don't spend unnecessarily, and don't leave things to chance, since today has the capacity to disguise or hide the downside of a potentially costly expenditure!",
      "18": "Planetary shifts are likely to switch the focus to something that you have perhaps not dealt with fully. This is most likely to be related to an old or ongoing emotional/romance matter, but with a new twist. That said; beware of being reacting too soon, since further planetary changes could bring additional information tomorrow!",
      "19": "Romance is very definitely the order of the day for you right now. The moon combined with the other planets that are affecting you indicates there is every chance that tonight will be a night to remember. It may even be time for a seriously significant commitment!"
  },
  "pisces": {
      "0": "You might be feeling as though no one is really listening to you, but it is all down to the watery moon. Take a couple of good friends to the nearest mall for lunch and some shopping. Lunch will provide the company you need, while a new outfit will increase your sense of worth!",
      "1": "A watery Mars/moon combination may bring a mixed vibe. There may be a tendency to overlook one possibility on the material front and focus instead on more unrealistic aims or goals. Incoming information may be misinterpreted and you may end up focusing on something that isn't entirely reliable!",
      "2": "It's a day where you may be inclined to misinterpret rather positive responses as indifferent ones and as a result, you could appear a little distant to others. It's possible that second-thoughts or doubts are beginning to develop when it comes to an established or previous agreement!",
      "3": "You may be feeling unusually chilly or distanced, and it will be important to keep in touch with your softer side. You may have a tendency to keep your deepest thoughts to yourself to maintain a fairly resolute image. However, this may not actually inspire other people's confidence!",
      "4": "A sun/moon aspect could act one of two ways. It will either guide you to introduce a little balance into your day-to-day schedule, which is likely to serve your long term interests, or it will encourage a slightly narrow perspective, which will offer a short-lived, very short term boost!",
      "5": "The brief lunar aspect is likely to get you thinking about one or two key areas of your life. Finances and leisure come under the spotlight as you are reminded to cut down a little. Don't be dismayed by unwelcome news; see it as a chance to make some overdue improvements!",
      "6": "It's possible that you will be disinclined to pay much attention to what's beneath the surface. In addition; there's a small hint of selfish impulses in your methods, especially when it comes to revisiting a pre-agreed plan. This combination, if you're not careful, could see you lose out on something good!",
      "7": "We all have 'bad hair' days, and today it'll be your turn. An inexplicable slump in your self esteem can be blamed on the planets, but later in the day you'll get a chance to lift your spirits at either work or home. No matter how badly the day seems to start just remember it will get much better!",
      "8": "Thanks to the dynamic vibe, you may be encouraged to go the extra mile today. A propensity to rise to the challenge could see a few welcome results develop sooner rather than later. That said; don't allow a vague piece of information to absorb your day. It should become clear in good time!",
      "9": "The day may well raise a few choices. Luckily they're not serious ones, but you will need to take a level headed approach rather than throwing yourself wholesale into one thing. Money and friendships are most likely to be the key areas where you will need to impose some balance!",
      "10": "It's a day where misunderstandings can be minimized quite easily by being attentive to others and taking care with what you say. Something said may impact, but not just yet. When it comes to romance, something you hear could tempt you into investigating further, but it may be wise to give this more time!",
      "11": "It's certainly a day for re-evaluating a matter that has maybe caused some stress. A fresh eye or perspective may well pave the way for an easier time. Alternatively; one recent matter could undergo a surprising development. All that said; this may require a more measured approach!",
      "12": "It's not a bad day, but if there is an element of feeling time-pressured, then it is likely to be self-imposed. Giving in to spur-of-the-moment impulses won't help either. It may seem that there's an awful lot of hard work for so little gain, but if help is on offer, then at least consider it!",
      "13": "There is a chance to make a few extra bucks today and although it may sound unappealing, you will find that your efforts are well rewarded! Don't plan to spend all your hard-earned cash though; store some away for your summer vacation!",
      "14": "The confident vibes are likely to kick in from the very start, making this quite a strong, decisive day in practical and material terms. However; it's also a day to be sensitively adaptable. It may be best to be a little softer on the emotional front, because a 'one-size-fits-all' policy won't necessarily work!",
      "15": "There is enough of a positive vibe to appreciate, if you can tap into it. However, given the sterner undercurrent, the sense of achievement might not be as immediate or obvious as you would like. You may need to exercise more patience for the right and visible results!",
      "16": "A sun/moon aspect could act one of two ways. It will either guide you to introduce a little balance into your day-to-day schedule, which is likely to serve your long term interests, or it will encourage a slightly narrow perspective, which will offer a short-lived, very short term boost!",
      "17": "This could quite easily turn into one of those days where everyone offers you the sort of advice that is well-meaning but not very practical. A tricky or important choice is likely to be the prime reason you're seeking advice; the planets suggest that you consider this dilemma for a few days longer, if possible!",
      "18": "There's a certain element of randomness, but planetary shifts may well bring a slightly capricious vibe in romance. In addition, you may need to bear in mind that perhaps you got something wrong.  All that said, though, someone who's perhaps slightly aloof will be more approachable after today!",
      "19": "It's possible that you'll come up against a couple of obstacles in the course of the day, thanks to unreliable sources, which may draw your attention to a slow development on the work/career front. A couple of confusing angles could muddy the waters even more. Focus on facts and facts alone!"
  },
  "sagittarius": {
      "0": "You're still likely to yearn for some definite changes to your life, but you need to be patient; the planning stage is as important as the taking action stage. Stop looking to the future and remember the here-and-now. There may be a little confusion to resolve over an emotional/romantic matter!",
      "1": "A steady, reliable approach is your best strategy from start to finish, today. Don't be lulled into a state of complacency when it comes to personal matters, either. A more sensitive, supportive response may be the best one in terms of someone's news. Treat others as you would like to be treated!",
      "2": "The morning's placid vibe is likely to present a particular problem in one way, while the afternoon's edgier vibe is likely to paint a different picture. If someone draws your attention to a mistake, don't assume that their intentions are poor. You may just need to accept a moment of verbal clumsiness!",
      "3": "A fretful sun/moon mix could stir up fairly minor worries. There is a very rare tendency to let other people's opinions influence your thinking too much. It may begin to feel like the more accommodating you are, the more others will impose. A calmly issued, fair but definite 'no' may do wonders!",
      "4": "Planetary shifts are likely to highlight ongoing matters, but with a slight twist or a new angle to consider. An evenly-weighted either/or choice could develop between what your heart wants and what your head says. There is a strong possibility that this could graze against romantic matters!",
      "5": "It's not a bad day, thanks to a tempered vibe. The communication lines should open up enough to assist or boost a personal choice or preference. In addition, it is possible that a past error, quite possibly a minor one, will be corrected in your favor. Even very low-level good luck shouldn't be questioned!",
      "6": "There's a very subtle element of shifting pressure in the general vibe. You may need to switch and adapt your approaches more quickly than you would like. In particular; a personal issue may require more time than you assume and fresh news could be a bit of a red herring!",
      "7": "The afternoon's lighter-hearted vibe will offer an overdue lift, if you let it, and a welcome break in your routine could reverse any feelings of stagnation or sluggishness.  All that said; what could hold you back is a slight tendency to search for concealed and meanings to trivial exchanges!",
      "8": "You may experience one of those days where there's a wide gap between thought and action. What is suggested and/or promised may well be left up in the air, thanks to an unreliable vibe. If there's a slight disappointment to factor in, try to remember that it's almost definitely an unintentional one!",
      "9": "Today's vibe may feel a little fretful. Try not to react to it, because instead of dealing with a problem, you're likely to go off on a tangent instead. When it comes to an unresolved matter, you could be in receipt of some welcome news. There's certainly every indication that something is untangled!",
      "10": "The shifting vibe could give way to a slightly unreliable undercurrent, but only briefly. Your best strategy may be to hold off before you respond too quickly to a letdown. A temporary lack of support on the material/practical front is possible. An offer could be retracted at the last minute, too!",
      "11": "It's possible that you will feel a little constrained, thanks to a negative formation. This sense of restriction could be down to either your immediate environment, or due to incoming information. Try not to overreact to whatever is bugging you; tomorrow lightens the load all round!",
      "12": "You're still likely to yearn for some definite changes to your life, but you need to be patient; the planning stage is as important as the taking action stage. Stop looking to the future and remember the here-and-now. There may be a little confusion to resolve over an emotional/romantic matter!",
      "13": "Your inner voice may be quite piercing (and probably on the right track too). Given this, maintaining a neutral position may well be almost impossible. Try not to give in to gut feelings. Employ as much common sense as you can. You may even benefit from dismissing something you hear!",
      "14": "A relatively easy-going day is on offer if you can get into a relaxed frame of mind. However, the key word is 'if,' since you're likely to be in too much of a stubborn mood. Personal pride will perhaps be a factor too. Bear this in mind if someone comes to your aid!",
      "15": "It is possible that you'll get hints of something new, but confirmation may not materialize immediately. When it does, you may realize that some form of compromise will be in order. All that said; the ability to negotiate fairly could spare you from committing to poorer terms and conditions!",
      "16": "Today should be an improvement on yesterday, with romance looking less complicated, and it's likely you'll start looking forward to the coming weekend. However, spending a couple of hours down the gym this evening will help dispel a lingering feeling of restlessness and edginess!",
      "17": "A tactful vibe will offer discreet support, especially when it comes to something waiting to be resolved. You should be able to deal fairly easily with a particular individual who may be either difficult to read or just outright awkward. It may be a question of figuring out the right approach!",
      "18": "There is a slightly thoughtless vibe. Even water signs may succumb to this for a while. Tensions can be eased if you acknowledge other people's views and opinions, and a little token/gesture of appreciation will help to reverse what could be a slightly negative view, particularly in matters of the heart!",
      "19": "It might be that you need to sit down at some point to work through some issues with a family member. The problem is that you're unlikely to be in a very giving mood, which could create rather than ease any minor tensions. Don't be too secretive as you do need to talk!"
  },
  "scorpio": {
      "0": "If it looks as though someone is about to make a mistake, then you can probably get away with intervening, but only through gentle and discreet means. Offer guidance. Harsh words will get you nowhere. As an aside, make sure that you're seen to be doing your fair share, in order to keep the mood neutral!",
      "1": "Given that you're likely to be quite sensitive to the lunar vibe, it may turn out to be quite a strong start to the week. Some indirect good news could indicate minor but positive developments in the very near future. It may be unadvisable to question or critique a moment of low-level good luck!",
      "2": "There's a stacked planetary emphasis on communications. News may come in, but in little dribs and drabs. The main essence may not be immediately apparent. Something may need to be confirmed and details may make a difference. It's perhaps a day to collate, rather than act!",
      "3": "The moon may be a little volatile and melodramatic. In romance there is likely to be an up-down pattern. On the work/school front it's likely to be unsettling; and it may well be a little disruptive when it comes to domestic matters too. Aim to defuse any potential frictions!",
      "4": "Avoid the mall today. Your cash flow isn't a problem, but a couple of frustrating and time-consuming influences suggest that shopping treks will only result in disappointment. It's more than likely that you won't be able to find what you're looking for, so hold on to your money for now!",
      "5": "A contradictory mix of aspects and influences suggests that you'll be hard to please today. You won't want to feel hemmed in, but you won't want to feel ignored either. You may want some space, but you won't want to feel alone! Bear in mind that it's the planets making you feel this!",
      "6": "The general vibe may well appear to be quite stable and reliable. However, thanks to strong oppositions between the planets, it's possible that you'll need to rethink your plans for the day, since a forgotten obligation could resurface out of the blue. Don't be tempted to side-step this one!",
      "7": "A Venus/Mars combination might complicate your love life, and thanks to a couple of lunar influences, you are likely to feel things even more deeply than normal. Going to the mall for some chic and stylish accessories to boost your confidence will be the palliative you need!",
      "8": "The emphasis may swing to the theme of new over old, or possibly new from old. There's a sense of unexpected progress or even closure. As an aside; don't be too pushy when it comes to an emotional issue: it's certainly a day to give someone a little breathing space!",
      "9": "In general terms there is not a great deal of sensitivity or tact in the current planetary vibes, so do try to watch what you say. It's highly likely that you are going to be that little bit more happy-go-lucky and a little less careful on the romance front. Be prepared to smooth over a blunder!",
      "10": "You'll need to curb a tendency to be a little wild and unruly, or you'll get nothing done. The airy vibe has the capacity to hold you back, and you'll have to watch a tendency to be a little fickle in your close relationships. Schedule those moments of fun appropriately!",
      "11": "As with several other signs, there may be a couple of minor realizations as very recent errors and slip ups come to light. For you, this may revolve more around an emotional matter. Quick-fix solutions to emotional issues may well be highly tempting, but these may not work!",
      "12": "The day is likely to be marked with a drive to address and clear out any lingering holdups, obstructions or blocks, thanks to a fresh, invigorating vibe. New and possibly inspirational incoming information will be your motivating factor. However, do accept that you can only do so much!",
      "13": "Today's planetary line-up is likely to provide some food for thought, although the sun/ moon mix may well bring a kind of exasperating inflexibility to certain remedies and solutions to ongoing matters. In addition; if a minor control-issue is in play at all, then it's likely to become apparent!",
      "14": "There's a stacked planetary emphasis on communications. News may come in, but in little dribs and drabs. The main essence may not be immediately apparent. Something may need to be confirmed and details may make a difference. It's perhaps a day to collate, rather than act!",
      "15": "It may not actually be the worst strategy to leave everything to the last minute, since the late afternoon influences bring both cool composure and insight. Address routine, work and domestic matters later rather than sooner. If something looks difficult, leave it a while and come back to it!",
      "16": "You're known to be one of the most focused signs, but unusually for you, you're likely to feel in quite a frivolous mood today. You may feel tempted to drop everything, especially if fun is lacking and work feels too dull. But,  it is inadvisable to follow this route!",
      "17": "You may well need a little space throughout the day. It may be a day to avoid collaborative efforts and to try and work alone, if possible, since it'll be easier than usual to say the wrong thing at the wrong time. If this does happen, you may need to throw in one or two concessions to reverse this!",
      "18": "Even though the vibe might feel crisp and efficient, you might be wise to have little safety nets in place, since it's possible that a single-minded approach on a matter could lead you in the wrong direction. In addition; a minor retraction or reversal could require some quick thinking on your part!",
      "19": "The general vibe might slow you down enough to make this day quite unproductive. Maybe it will be best to decide from the start what you will focus on and then stick to it. The source of tension is likely to be between progress at work and maintaining a slightly independent outlook!"
  },
  "taurus": {
      "0": "You are likely to be in the mood for a spot of pampering and fun, but aim to treat yourself without going overboard, since there is a tendency to be a little too generous and/or extravagant. Ease up on the food, drink and spending. Know your limits and don't over-indulge!",
      "1": "It's a more sincere day in relative terms, but the prevailing vibe is likely to amplify the materialistic side of your nature, which could lead you into some difficulties. A slightly selfish vibe may be the real culprit of possible tension. Money will be another area that requires a cool-headed approach!",
      "2": "It may be wise to watch incoming and outgoing information, since the scope for errors will be there, at least until the late afternoon. Watch out for carelessness with material and financial details in particular before that point. A tendency to rush decisions may need to be addressed first!",
      "3": "Today is likely to be very relaxing, very friendly, and very sociable, but only if your time is yours, or you're the one dictating the pace. If, however you have chores on the domestic front, or there any outstanding matters that require concentration, then you may find it difficult to keep the distractions at bay!",
      "4": "There may be a slight tendency to assume a little too much. In addition; thanks to the rather exuberant vibe you could assume that you've got the cosmic green light to go ahead with a potentially unwise decision. You may need to occupy the middle-ground when it comes to some straight talking!",
      "5": "The moon in your career zone is likely to draw your attention to certain matters: details, deadlines and overdue targets are likely to irk you more than usual. All that said; the end result is that you may experience a moment of clarity over something has perhaps been troubling you recently!",
      "6": "It's a day where slowing down may actually help you to get more done. You may think that you're working steadily and you may not even realize that you're operating at a rushed pace, but others are likely to. Attention to detail is far more likely to secure the results you want!",
      "7": "The slower pace may feel more formal, particularly when it comes to verbal exchanges and romantic interactions in particular. Something in the very early stages of development could stutter. What may stall progress is a lack of patience, which in turn could segue into a miscommunication!",
      "8": "You're more than likely to be preoccupied with romance, thanks to lingering influences, which suggests that you'll need to either take a new approach in your love life, or that you'll need to reconsider something. An upbeat attitude could bring about some ultimately positive changes!",
      "9": "It's likely to be a useful day in terms of practical and material matters, so long as you opt for the most sensible course of action. While the planets might bring a minor opportunity your way, it's still entirely possible that you may give in to a rather extravagant undercurrent!",
      "10": "Beneficial planetary influences may well add the missing spark to romance. That said; there's a subtle vibe at work. As irksome as it sounds, a vague hint from someone will almost definitely require a more decisive response. It may not be the best day to take a back seat!",
      "11": "You're likely to be torn between sticking to what feels safest and going somewhat out on a limb. After the caution of the past couple of days you're more likely to favor the risks, but it may not be a good idea to leave a friend to do what you can't. Make sure that your claims can be carried out!",
      "12": "A quiet or brief exchange may not seem like a great development, but it will allow you to retrace your steps over certain matters. That said; this is a day where your judgment may be a little off, especially in the later hours. Try to avoid making promises, no matter how good your intentions are!",
      "13": "A rather strident vibe with a marginally fretful undercurrent could set the tone for the day. This could facilitate a narrower view of a specific situation than is truly helpful. In addition; there's a chance that your responses will be governed by a trace of unidentified anxiety. Count to ten before agreeing to anything!",
      "14": "Shifting influences will bring a definite upside. You should feel more in control and possibly emboldened enough to perhaps try something a little new. Just try to resist exerting too much influence over how the day shapes up when it comes to other people's reactions and responses!",
      "15": "Today will be a day to celebrate as you'll shake off two restrictive influences. Be true to your instincts and make a decision based on your reliable intuition, because an issue (quite possibly linked to romance) is about to be resolved!",
      "16": "Thanks to the moon, this will be a day with two sharply contrasting halves. In the morning you will be motivated and keen to perhaps initiate a longer-term project or aim. This afternoon, though, you may lose that feeling quite quickly, so do take care not to assume too much!",
      "17": "A minor stroke of good fortune could brighten up your day. It may be that your finances are primed to receive a minor boost, most likely through a little extra work. It's not likely to be the sort of opportunity that available open for long, so you may need to act quickly or at least not dawdle!",
      "18": "There is a tendency to come across as slightly judgmental or harsh. However; the root cause of this could be that you experience a burst of temporary insecurity: it could be that you begin to second-guess a previously confident decision. Give yourself a couple of days before undoing or reversing anything!",
      "19": "Although nothing will seem to go wrong as such, the overriding vibe isn't likely to feel very cooperative. All that said; if you can become a little more objective and detached, then an ongoing or recent obligation could perhaps be resolved. However; a compromise may be required!"
  },
  "virgo": {
      "0": "The vast array of lunar aspects will make for a rather challenging day today, although your natural optimism and irresistible humor will steer you though nicely. Someone's invaluable advice will throw an entirely different perspective on one particular problem that is perhaps connected to an authority figure!",
      "1": "Thanks to the bubblier vibe, a moment of sensitive and/or insightful timing could bode well for emotional/romantic matters. Misunderstandings and crossed wires will be entirely avoidable. That said; don't make casual, offhand offers, unless you intend to stick to them. Being inattentive could rebound!",
      "2": "Communications may be a little off-key, but it won't be an overly serious issue. However, you may feel a little frustrated with a noticeable slacking off. If yesterday was bustling but inefficient, today is likely to be much slower, but more industrious. It may be best not to try and control the pace!",
      "3": "An inability to recognize the bigger picture may well hold you back slightly. There's a degree of clarity when it comes to making decisions that impact on the near future. However; this analytical ability may be somewhat absent with regard to emotional and romantic matters!",
      "4": "It's a day where it may seem as though others are capable of being more cunning and/or resourceful, while you're left standing still. It will be possible to take advantage of the discreetly constructive vibe: you may just need to think a little laterally when it comes to incoming news!",
      "5": "A picky and unhelpful Jupiter/moon mix may leave you feeling a little out of sorts for no real reason. Everyday decisions are likely to be tinged with an anxious glass-half-empty approach. However, this counterproductive mood will perhaps be explained, one way or another, in the evening!",
      "6": "There is a likelihood that communications could become confused, especially after lunch and this may lead to a fractious exchange unless you're careful. If someone – quite possibly a fellow fire sign – tests your patience, then step back. Simple errors will be much easier to spot if your head is clear!",
      "7": "You could find yourself zooming in on quite trivial developments when it comes to work matters. There's possibly a hint of having second thoughts over a recent decision or result. All that said; a terse Venus/moon mix suggests that romance, rather than work, is the reason for a subtle discontent!",
      "8": "Material matters are likely to edge to the top of the agenda, but within the context of a wiser vibe. If you've been a little extravagant recently, either with your material zone or with verbal promises, then today may be a good day to remedy and refine any issues or misunderstandings!",
      "9": "Lunar aspects may well cloud certain issues, since you might find that your logical, analytical traits are not as reliable as usual. If so then avoid financial decisions, for obvious reasons. That said; an ability to get straight to the root-cause of non-financial problems may be a hidden strength!",
      "10": "A Venus/moon mix brings a rather open vibe, which has the capacity to resolve an ongoing matter in a way that perhaps didn't seem feasible before. An indirect interruption to your day may be the actual catalyst and although the news may be a little unsettling at first, stick with it!",
      "11": "The planets, which have been focusing mainly on work matters, are likely to bring in a softer vibe. Your concentrations may slip and you may well be more prone than usual to agreeing with more persuasive opinions and 'credible' arguments. Take care: the signs suggest a sharp U-turn in a few days' time!",
      "12": "A marginally sloppy vibe could edge in and while you may not notice the effects it could have a low-level impact on material/practical matters. Incoming news may seem to be very encouraging at the first glance, but do give yourself a cooling-off period for any major decisions!",
      "13": "After a couple of gloomier days there should be a noticeable lift. A straight-talking vibe may well assist communications. Don't get too blasé about a minor success, and you should find that you're more on the ball throughout the day. Specifically: don't rely on luck, chance or charm!",
      "14": "You may be more responsive than you realize to a marginally fretful vibe. With this in mind you should avoid thinking about the past or looking backwards.  It may be tempting to rehash something: possibly from the very recent past, but today may not be the day to do it!",
      "15": "It could almost be described as the perfect day for you today: routine tasks or chores won't seem so draining; friends should provide the fun and laughs and romance is well-aspected too. To top it off there's a chance that you'll have a bit of luck with money, maybe even a win.",
      "16": "The weekend is almost over, but you are more than ready to go out and have some fun. However, the planets may well have other ideas. It looks as though some work related issue may impinge on your free time and you may have to put any other plans on hold for a while!",
      "17": "Although you may notice the fretful undercurrent, there is likely to be a silver lining to any little glitches. Specifically, don't allow one minor piece of unexpected news to dominate the day, because it may be feasible to actually turn this to your advantage in the medium to long term!",
      "18": "Change is in the air, but possibly on a day where all you can do is store it for now. Something you glean could change your attitude when it comes to a particular person or specific event. It's certainly a day to pay attention, since incoming information is likely to bubble up at some point!",
      "19": "The minor Mars/Pluto aspect seems to be throwing a slight shadow over romantic developments again! However, this time it could be that someone wants more from you than you're prepared to give. Ask yourself: are they being reasonable? Ask yourself: are you being reasonable?"
  }
}